cases/T4_motorBike/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T4 - motorBike (spec 13)
  Force coefficients: tutorial settings (forceCoeffs1 of the v2606 tutorial):
  |U_inf| = 20 m/s, lRef = 1.42 m (wheelbase), Aref = 0.75 m2 (estimated),
  CofR at the axle midpoint on the ground.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// Set by Allrun: coupledFoam or simpleFoam
application     coupledFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        log             false;

        patches         (motorBikeGroup);
        rho             rhoInf;
        rhoInf          1;
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            (0.72 0 0);
        pitchAxis       (0 1 0);
        magUInf         20;
        lRef            1.42;
        Aref            0.75;
    }
}

// ************************************************************************* //
