cases/T4_motorBike/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T4 - kOmegaSST (Allrun -turbulence overrides)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
