cases/T4_motorBike/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T4 - motorBike (tutorial)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

nu              1.5e-05;

// ************************************************************************* //
