cases/T4_motorBike/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T4 - motorBike (tutorial boundary conditions).
  The motorBike patches are addressed through their group motorBikeGroup
  (snappyHexMesh names them motorBike_<region>).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    motorBikeGroup
    {
        type            zeroGradient;
    }

    #include "include/frontBackUpperPatches"

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
