cases/T4_motorBike/0.orig/include/fixedInlet
// Inlet: fixed at the internal (freestream) value

inlet
{
    type            fixedValue;
    value           $internalField;
}
