cases/T4_motorBike/0.orig/include/frontBackUpperPatches
// Far-field side and top patches: slip

upperWall
{
    type            slip;
}

frontAndBack
{
    type            slip;
}
