cases/T4_motorBike/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T4 - motorBike (tutorial boundary conditions).
  The motorBike patches are addressed through their group motorBikeGroup
  (snappyHexMesh names them motorBike_<region>).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    motorBikeGroup
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    #include "include/frontBackUpperPatches"

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
