cases/T4_motorBike/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T4 - motorBike
  Identical schemes for coupledFoam and the simpleFoam reference (spec 14):
  linearUpwind grad(U), Gauss linear corrected. grad(U) cellLimited and the
  upwind turbulence convection are the tutorial settings.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)          bounded Gauss linearUpwind grad(U);
    div(phi,U)_upwind   bounded Gauss upwind;

    turbulence      bounded Gauss upwind;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;

    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
