cases/T4_motorBike/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T4 - motorBike
  solvers.coupled : block linear solver (spec 6.1 as replaced by amendment B1,
                    blockGAMG per B3)
  coupled         : outer iteration controls (spec 11, amendment B8)
  k, omega        : native segregated turbulence solve (spec 5.8)
  SIMPLE, p, U    : native simpleFoam reference (SIMPLEC, spec 13/14;
                    tutorial solver settings)
  relaxationFactors: from system/relaxation, which Allrun copies from
                     relaxation.coupledFoam or relaxation.simpleFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    coupled
    {
        solver          blockFGMRES;
        preconditioner  blockGAMG;
        tolerance       1e-8;
        relTol          0.05;
        adaptiveRelTol  yes;
        etaMin          1e-3;
        etaMax          0.5;
        gammaEW         0.9;
        alphaEW         2;
        minIter         1;
        maxIter         200;
        restart         10;
        blockGAMG
        {
            agglomerator          faceAreaPair;
            mergeLevels           2;
            nCellsInCoarsestLevel 200;
            processorAgglomerator masterCoarsest;
            cycleType             K;
            kCycleThreshold       0.25;
            kCycleMaxSteps        2;
            smoother              blockGaussSeidel;
            nPreSweeps            1;
            nPostSweeps           2;
            nFinestSweeps         2;
            coarsestSolver        blockBiCGStab;
            coarsestTolerance     1e-3;
            coarsestMaxIter       50;
            maxOperatorComplexity 1.5;
            cacheAgglomeration    true;
            autoTune              yes;
            tuneInterval          50;
            nPostSweepsMax        4;
        }
    }

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    Phi
    {
        $p;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }
}

coupled
{
    maxIter             3000;
    potentialInit       yes;
    startupUpwindIters  50;
    nonOrthLimiter      0.5;

    ptc
    {
        cflStrategy     mRDM;
        CFL0            5;
        CFLmin          1;
        CFLmax          500;
        gamma           1;
        betaMax         1.5;
        betaExp         1.1;
        nHold           10;
        maxLinFails     3;
    }

    lineSearch
    {
        fU              0.3;
        fp              0.5;
        omegaMin        0.1;
        kappa           0.5;
        maxCflCuts      3;
    }

    localLimit
    {
        enabled         yes;
        fLoc            0.5;
    }

    anderson
    {
        enabled         no;
        m               4;
        beta            1.0;
    }

    remediation
    {
        static
        {
            enabled             yes;
            nonOrthThreshold    70;
            skewThreshold       4;
            volRatioThreshold   20;
            aspectThreshold     1000;
            beta                0;
            nonOrthLimiter      0.2;
            cflFactor           0.5;
        }
        dynamic
        {
            enabled             yes;
            cU                  2;
            cp                  5;
            cSpike              0.5;
            nLayers             1;
            nQuietIters         20;
            cflFactor           0.1;
            clipToNeighbourMean yes;
        }
        zonal
        {
            enabled             no;
        }
    }

    sentinel
    {
        maxRollbacks    5;
    }

    bounds
    {
        kMin            1e-12;
        omegaMin        1e-6;
        nutMaxFactor    1e5;
    }

    convergence
    {
        mode                any;
        forceCoeffsWindow   100;
        forceCoeffsTol      0.002;
        residualTol         1e-6;   // stops earlier on the Cd/Cl window (12.3 ii)
    }

    ftz             yes;
    writeState      yes;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    // Reference converged to 1e-8 (spec 13); on this mesh the run normally
    // ends at endTime and is judged by the window criterion (12.3 ii) on
    // Cd/Cl, like coupledFoam.
    residualControl
    {
        p               1e-8;
        U               1e-8;
        "(k|omega)"     1e-8;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

cache
{
    grad(U);
}

#include "relaxation"

// ************************************************************************* //
