cases/T4_motorBike/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T4 - motorBike: mesh quality (tutorial settings)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}

#includeEtc "caseDicts/meshQualityDict"

minFaceWeight 0.02;

// ************************************************************************* //
