cases/T4_motorBike/Allrun
#!/bin/sh
#------------------------------------------------------------------------------
# T4 - motorBike, kOmegaSST, snappyHexMesh (spec 13)
#
#   ./Allrun [-mesh a|b] [-solver coupledFoam|simpleFoam] [-np N]
#            [-turbulence MODEL] [-mesh-only] [-remesh] [-restart]
#
#   -mesh a      tutorial refinement (~350 k cells)                  [default]
#   -mesh b      refinement levels +1 on the motorBike surface, its feature
#                edges and the refinement box (target 3-5 M cells); realised
#                by foamDictionary edits of system/snappyHexMeshDict
#   -np N        ranks for meshing and solving (default 16, scotch)
#   -mesh-only   mesh and checkMesh only (or reuse and re-decompose an
#                existing mesh for -np); writes mesh_cells.txt and mesh.info
#   -remesh      mesh again even if the case already holds a mesh of the
#                requested variant
#   -restart     continue the solver from the latest time; no mesh, no
#                potentialFoam, log goes to log.<solver>.restart
#
# Mesh reuse: a case that already holds a mesh of the requested variant
# (mesh.info, e.g. copied from a -mesh-only run) is not meshed again. A mesh
# decomposed for a different rank count is reconstructed once
# (reconstructParMesh -constant) and decomposed for -np.
#
# The geometry motorBike.obj.gz is copied from $FOAM_TUTORIALS at run time.
# Everything stays decomposed; there is no reconstructPar.
#
# coupledFoam with coupled.potentialInit yes: potentialFoam -writePhi
# -writep initialises U, p, phi first (spec 7.4). Parallel runs: mpirun with
# core binding (CF_MPI_BIND=none on a shared machine); CF_RANK_WRAPPER wraps
# every rank of the solver and potentialFoam (benchmark harness).
#------------------------------------------------------------------------------
cd "${0%/*}" || exit 1
. "${WM_PROJECT_DIR:?}"/bin/tools/RunFunctions

solver=coupledFoam
np=16
model=""
variant=a
meshOnly=false
remesh=false
restart=false

while [ "$#" -gt 0 ]
do
    case "$1" in
        -mesh) variant="$2"; shift 2 ;;
        -solver) solver="$2"; shift 2 ;;
        -np) np="$2"; shift 2 ;;
        -turbulence) model="$2"; shift 2 ;;
        -mesh-only) meshOnly=true; shift ;;
        -remesh) remesh=true; shift ;;
        -restart) restart=true; shift ;;
        *) echo "Unknown option $1" 1>&2; exit 1 ;;
    esac
done

case "$variant" in
    a|b) ;;
    *) echo "Unknown mesh variant '$variant' (a|b)" 1>&2; exit 1 ;;
esac

bind="${CF_MPI_BIND:-core}"
if [ "$bind" = core ]
then
    mpiOpts="--bind-to core --map-by core"
else
    mpiOpts="--bind-to $bind"
fi

# Run an application serial or parallel; log name as $2.
# CF_RANK_WRAPPER (benchmark harness) wraps every rank, e.g. for
# /usr/bin/time -v (bench/rank_wrapper.sh).
runApp()
{
    app="$1"; log="$2"; shift 2
    if [ "$np" -gt 1 ]
    then
        mpirun $mpiOpts -np "$np" $CF_RANK_WRAPPER "$app" -parallel "$@" \
            > "$log" 2>&1
    else
        $CF_RANK_WRAPPER "$app" "$@" > "$log" 2>&1
    fi
}

# Meshing application, serial or parallel, never wrapped; fails on a
# non-zero exit code or a FOAM FATAL message in the log.
runMeshApp()
{
    app="$1"; log="$2"; shift 2
    echo "Running $app ($np ranks) -> $log"
    if [ "$np" -gt 1 ]
    then
        mpirun $mpiOpts -np "$np" "$app" -parallel "$@" > "$log" 2>&1
    else
        "$app" "$@" > "$log" 2>&1
    fi
    rc=$?
    if [ "$rc" -ne 0 ] || grep -q "FOAM FATAL" "$log"
    then
        echo "$app failed (exit $rc), see $log" 1>&2
        return 1
    fi
}

# Serial application with a fresh log (runApplication skips existing logs)
runSerial()
{
    app="$1"; log="$2"; shift 2
    echo "Running $app -> $log"
    "$app" "$@" > "$log" 2>&1
    rc=$?
    if [ "$rc" -ne 0 ] || grep -q "FOAM FATAL" "$log"
    then
        echo "$app failed (exit $rc), see $log" 1>&2
        return 1
    fi
}

meshInfo()
{
    [ -f mesh.info ] && sed -n "s/^$1  *//p" mesh.info
}

# writeMeshInfo <np> <reconstructed yes|no> <cells>
writeMeshInfo()
{
    printf 'variant %s\nnp %s\nreconstructed %s\ncells %s\n' \
        "$variant" "$1" "$2" "$3" > mesh.info
}

setSubdomains()
{
    foamDictionary -entry numberOfSubdomains -set "$np" \
        system/decomposeParDict > /dev/null
}

# Refinement levels of the variant (idempotent: both variants set all
# values, so a case can be switched between a and b)
setMeshLevels()
{
    case "$variant" in
        a) surf="(5 6)"; feat=6; box=4 ;;
        b) surf="(6 7)"; feat=7; box=5 ;;
    esac
    shm=system/snappyHexMeshDict
    cmc=castellatedMeshControls
    foamDictionary -disableFunctionEntries $shm \
        -entry $cmc/refinementSurfaces/motorBike/level -set "$surf" \
        > /dev/null || return 1
    foamDictionary -disableFunctionEntries $shm \
        -entry $cmc/features \
        -set "( { file \"motorBike.eMesh\"; level $feat; } )" \
        > /dev/null || return 1
    foamDictionary -disableFunctionEntries $shm \
        -entry $cmc/refinementRegions/refinementBox/levels \
        -set "((1e15 $box))" > /dev/null || return 1
    echo "Mesh variant $variant: surface level $surf, features $feat," \
        "refinementBox $box"
}

# Case-specific mesh generation (parallel like the tutorial)
mesh()
{
    # Clean completely first: hexRef8 cannot refine an already refined mesh
    rm -rf processor* constant/polyMesh constant/extendedFeatureEdgeMesh \
        constant/triSurface mesh.info mesh_cells.txt 0
    mkdir -p constant/triSurface
    cp -f "${FOAM_TUTORIALS:?}"/resources/geometry/motorBike.obj.gz \
        constant/triSurface/ || return 1

    setMeshLevels || return 1
    runSerial blockMesh log.blockMesh || return 1
    runSerial surfaceFeatureExtract log.surfaceFeatureExtract || return 1
    if [ "$np" -gt 1 ]
    then
        setSubdomains
        runSerial decomposePar log.decomposePar -force || return 1
    fi
    runMeshApp snappyHexMesh log.snappyHexMesh -overwrite || return 1
    runMeshApp checkMesh log.checkMesh -constant || return 1

    cells=$(sed -n 's/^ *cells: *\([0-9][0-9]*\).*/\1/p' log.checkMesh \
        | head -n 1)
    echo "$cells" > mesh_cells.txt
    if [ "$np" -gt 1 ]
    then
        writeMeshInfo "$np" no "$cells"
    else
        writeMeshInfo 1 yes "$cells"
    fi
    echo "Mesh $variant: $cells cells"
}

# Decompose an existing mesh for a different rank count
redecompose()
{
    have=$(meshInfo np)
    [ "$have" = "$np" ] && return 0
    echo "Mesh decomposed for $have ranks, re-decomposing for $np"
    if [ "$(meshInfo reconstructed)" != yes ]
    then
        runSerial reconstructParMesh log.reconstructParMesh -constant \
            || return 1
    fi
    rm -rf processor* 0
    if [ "$np" -gt 1 ]
    then
        setSubdomains
        runSerial decomposePar "log.decomposePar.np$np" -force || return 1
    fi
    writeMeshInfo "$np" yes "$(meshInfo cells)"
}

# Initial fields; earlier solutions of this case are removed
fields()
{
    rm -rf postProcessing
    for d in [1-9]* 0.[0-9]* processor*/[1-9]* processor*/0.[0-9]*
    do
        [ -d "$d" ] && rm -rf "$d"
    done
    if [ "$np" -gt 1 ]
    then
        rm -rf 0
        restore0Dir -processor
    else
        restore0Dir
    fi
}

foamDictionary -entry application -set "$solver" system/controlDict > /dev/null
cp "system/relaxation.$solver" system/relaxation
if [ -n "$model" ]
then
    foamDictionary -entry RAS.RASModel -set "$model" \
        constant/turbulenceProperties > /dev/null
fi

if [ "$restart" = true ]
then
    runApp "$solver" "log.$solver.restart"
    exit $?
fi

if [ "$remesh" = false ] && [ "$(meshInfo variant)" = "$variant" ]
then
    echo "Reusing mesh $variant ($(meshInfo cells) cells," \
        "decomposed for $(meshInfo np) ranks)"
else
    mesh || exit 1
fi

redecompose || exit 1

[ "$meshOnly" = true ] && exit 0

fields

if [ "$solver" = coupledFoam ]
then
    potential=$(foamDictionary -entry coupled.potentialInit -value \
        system/fvSolution 2>/dev/null)
    case "$potential" in
        yes|on|true)
            runApp potentialFoam log.potentialFoam -writePhi -writep || exit 1
            ;;
    esac
fi

runApp "$solver" "log.$solver"

#------------------------------------------------------------------------------
